---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RoofType
source: html/9e9c34ba-8f13-dcd7-9d21-ba9febf78fbe.htm
---
# RoofType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.